package ex1;

/**
 * Created by Steve on 23.08.2015.
 */
public class Yard {
    public static void main(String[] args) {
        int i; // переменная с названием i, в которую разрешено сохранять только int.
        String s; // переменная с названием s, в которую разрешено сохранять только текст (String).


        // ПРАВИЛО: любой класс можно использовать в качестве типа переменной.

        Cat vaska; // переменная с названием vaska, в которую разрешено сохранять только Cat.

        // кошку создали, но не сохранили её адрес?
        new Cat(); // конструктор вызывается только вместе с new, если не наследование (inheritage)

        // теперь в cat1 разрешено хранить только координаты кошек. Чтоыб случайно в её координаты не положила собаку.
        Cat cat1 = new Cat(); // вернёт координаты кошки

        cat1.age = 10;
        cat1.name = "Мурка";

        cat1.eat();

        Dog dog = new Dog("Шарик", 3, false);
        dog.voice();

    }
}
